/**********************************°üº¬Í·ÎÄ¼ş**********************************/
#include <reg52.h>
#include "1602.h"
#include<intrins.h> 
/************************************ºê¶¨Òå************************************/
#define uchar unsigned char
#define uint unsigned int
#define VELOCITY_30C	3495       //30ÉãÊÏ¶ÈÊ±µÄÉùËÙ£¬ÉùËÙV= 331.5 + 0.6*ÎÂ¶È£» 
//#define VELOCITY_23C	3453       //23ÉãÊÏ¶ÈÊ±µÄÉùËÙ£¬ÉùËÙV= 331.5 + 0.6*ÎÂ¶È£» 
#define BASIC 3315
#define lambda 6
/************************************Î»¶¨Òå************************************/
sbit INPUT  = P3^2;                //»ØÉù½ÓÊÕ¶Ë¿Ú
sbit OUTPUT = P1^5;                //³¬Éù´¥·¢¶Ë¿Ú
sbit Beep   = P2^3;			           // ·äÃùÆ÷
sbit DS     = P2^2;                //define interface
sbit E=P2^5;            //Ê¹ÄÜĞÅºÅÎ»£¬½«EÎ»¶¨ÒåÎªP2.5Òı½Å
sbit BF=P0^7;           //Ã¦Âµ±êÖ¾Î»£¬£¬½«BFÎ»¶¨ÒåÎªP0.7Òı½Å
/********************************¶¨Òå±äÁ¿ºÍÊı×é********************************/
long int distance=0;               //¾àÀë±äÁ¿
uchar table[]="  Designed by  "; 
uchar table0[]="WeiLu and YuYaojia";
uchar table1[]="There's no echo.";
uchar table2[]="  www.hjmcu.com  ";
uchar table3[]="Distance:";
unsigned char code digit[10]={"0123456789"};     //¶¨Òå×Ö·ûÊı×éÏÔÊ¾Êı×Ö
unsigned char code Str[]={"Test by DS18B20"};    //ËµÃ÷ÏÔÊ¾µÄÊÇÎÂ¶È
unsigned char code Error[]={"Error!Check!"};     //ËµÃ÷Ã»ÓĞ¼ì²âµ½DS18B20
unsigned char code Temp[]={"Temp:"};             //ËµÃ÷ÏÔÊ¾µÄÊÇÎÂ¶È
unsigned char code Cent[]={"Cent"};              //ÎÂ¶Èµ¥Î»
uchar count;
/***********************************º¯ÊıÉùÃ÷***********************************/
extern void initLCD();
extern void write_date(uchar date);
extern void write_com(uchar com);
extern void delay(uint x);
long int VELOCITY;       //23ÉãÊÏ¶ÈÊ±µÄÉùËÙ£¬ÉùËÙV= 331.5 + 0.6*ÎÂ¶È£»
/******************************************************************************/
/* º¯ÊıÃû³Æ  : Delay_xMs                                                      */
/* º¯ÊıÃèÊö  : ÑÓÊ±º¯Êı                                                       */
/* ÊäÈë²ÎÊı  : x                                                              */
/* ²ÎÊıÃèÊö  : ÑÓÊ±Ê±¼ä                                                       */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/
void Delay_xMs(unsigned int x)
{
	unsigned int i,j;
  for(i = 0;i < x;i++ )
	{
		for(j = 0;j < 3;j++ )
		{
         ;
    }
  }
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : Alarm                                                          */
/* º¯ÊıÃèÊö  : ·äÃùÆ÷·¢Éùº¯Êı                                                 */
/* ÊäÈë²ÎÊı  : t                                                              */
/* ²ÎÊıÃèÊö  : ·¢ÉùµÄ´ÆµÂÊ                                                     */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/
void Alarm(uchar t)
{
	uchar i;
	for(i = 0;i < t;i++)
	{
		Beep = 0;
		Delay_xMs(1000/t);
		Beep = 1;
		Delay_xMs(1000/t);
	}
}	
/******************************************************************************/
/* º¯ÊıÃû³Æ  : delayt                                                         */
/* º¯ÊıÃèÊö  : ÑÓÊ±º¯Êı                                                       */
/* ÊäÈë²ÎÊı  : x                                                              */
/* ²ÎÊıÃèÊö  : ÑÓÊ±Ê±¼äÊı¾İ                                                   */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/	
void delayt(uint x)
{
	uchar j;
  while(x-- > 0)
		{
			for(j = 0;j < 125;j++)
			{
            ;
      }
    }
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : Init_MCU                                                       */
/* º¯ÊıÃèÊö  : ³õÊ¼»¯µ¥Æ¬»úº¯Êı                                               */
/* ÊäÈë²ÎÊı  : ÎŞ                                                             */
/* ²ÎÊıÃèÊö  : ÎŞ                                                             */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/
void Init_MCU(void)
{
	TMOD = 0x01;	  //¶¨Ê±Æ÷2³õÊ¼»¯,ÉèÖÃÎª16Î»×Ô¶¯ÖØ×°Ä£Ê½
 	TL0 = 0x66;
	TH0 = 0xfc;	    //1ms
  ET0 = 1;	      //¿ª¶¨Ê±Æ÷2
	EA = 1;		      //×ÜÖĞ¶ÏÊ¹ÄÜ
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : Init_Parameter                                                 */
/* º¯ÊıÃèÊö  : ³õÊ¼»¯²ÎÊıºÍIO¿Úº¯Êı                                           */
/* ÊäÈë²ÎÊı  : ÎŞ                                                             */
/* ²ÎÊıÃèÊö  : ÎŞ                                                             */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/
void Init_Parameter(void)
{
	 OUTPUT =0;//³¬ÉùÊä³ö¹Ø±Õ
	 INPUT = 0;//³¬ÉùÊäÈë¹Ø±Õ
	 count = 0;
	 distance = 0;
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : display_char                                                   */
/* º¯ÊıÃèÊö  : ÏÔÊ¾×Ö·û´®º¯Êı                                                 */
/* ÊäÈë²ÎÊı  : point,address                                                  */
/* ²ÎÊıÃèÊö  : Ğ´ÈëµÄ×Ö·û´®µÄµØÖ·Ö¸Õë 1602ÏÔÊ¾¶ÔÓ¦µÄµØÖ·                      */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/
void display_char(uchar *point,uchar address)
{
	uchar i;
	write_com(0x80 + address);
	for(i = 0;i < 16; i++)
	{
		write_date(*point);
		point++;
	}
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : display                                                        */
/* º¯ÊıÃèÊö  : ÏÔÊ¾Êı×Ö                                                       */
/* ÊäÈë²ÎÊı  : number£¬address                                                */
/* ²ÎÊıÃèÊö  : numberĞ´ÈëµÄÊı¾İ£¬addressµØÖ·                                  */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/	
void display(int number,uchar address)
{
	uchar b,c,d,e;
	b= (number / 1000);
	c= (number / 100) % 10;
	d = (number / 10) % 10;
	e = number % 10;
	write_com(0x80 + address);
  write_date(b + 48);
	write_date(c + 48);
	write_date(d + 48);
	write_date(46);           //Ğ¡ÊıµãµÄASCII
	write_date(e + 48);
  write_date(99);           //"c"µÄASCII
	write_date(109);          //"m"µÄASCII
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : Trig_SuperSonic                                                */
/* º¯ÊıÃèÊö  : ·¢³öÉù²¨º¯Êı                                                   */
/* ÊäÈë²ÎÊı  : i                                                              */
/* ²ÎÊıÃèÊö  : ·¢³öµÄÂö³å´ÎÊı                                                 */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/
void Trig_SuperSonic(int i)//³ö·¢Éù²¨40kHz
{
	int j;
	for(j=0;j<i;j++)
	{
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
	  _nop_();
	  _nop_();
	  _nop_();
	  _nop_();
	  OUTPUT = 1;
	  _nop_();
	 	_nop_();
		_nop_();
		_nop_();
		_nop_();
	  _nop_();
	  _nop_();
	  _nop_();
		_nop_();
	  OUTPUT = 0;
	}
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : Measure_Distance                                               */
/* º¯ÊıÃèÊö  : ¼ÆËã¾àÀëº¯Êı                                                   */
/* ÊäÈë²ÎÊı  : ÎŞ                                                             */
/* ²ÎÊıÃèÊö  : ÎŞ                                                             */
/* ·µ»ØÖµ    : 0ÊÇ³¬Ê±Ã»ÊÕµ½£¬1ÊÇÊÕµ½ÁË                                       */
/******************************************************************************/
int Measure_Distance(void)
{
	uchar l;
	uint h,y;
	TR0 = 1;
	while(INPUT==0)
		{
			if(count==18)
				{		
					TR0 =0;
		      TL0 = 0x66;
		      TH0 = 0xfc;
		      count = 0;
				}
				return 0;
    }	
	TR0 = 0;
	l = TL0;
	h = TH0;
	y = (h << 8) + l;
	y = y - 0xfc66;//us²¿·Ö
	distance = y + 1000 * count;//¼ÆËã×ÜÊ±¼ä
	TL0 = 0x66;
	TH0 = 0xfc;
	delayt(30);
	distance = VELOCITY * distance / 20000;
	return 1;
}
/*****************************************************
º¯Êı¹¦ÄÜ£ºÅĞ¶ÏÒº¾§Ä£¿éµÄÃ¦Âµ×´Ì¬
·µ»ØÖµ£ºresult¡£result=1£¬Ã¦Âµ;result=0£¬²»Ã¦
***************************************************/
bit BusyTest(void)
{
	bit result;
	RS=0;       //¸ù¾İ¹æ¶¨£¬RSÎªµÍµçÆ½£¬RWÎª¸ßµçÆ½Ê±£¬¿ÉÒÔ¶Á×´Ì¬
  RW=1;
  E=1;        //E=1£¬²ÅÔÊĞí¶ÁĞ´
  _nop_();   //¿Õ²Ù×÷
  _nop_();
  _nop_(); 
  _nop_();   //¿Õ²Ù×÷ËÄ¸ö»úÆ÷ÖÜÆÚ£¬¸øÓ²¼ş·´Ó¦Ê±¼ä	
  result=BF;  //½«Ã¦Âµ±êÖ¾µçÆ½¸³¸øresult
  E=0;         //½«E»Ö¸´µÍµçÆ½
  return result;
}
/*****************************************************
º¯Êı¹¦ÄÜ£º½«Ä£Ê½ÉèÖÃÖ¸Áî»òÏÔÊ¾µØÖ·Ğ´ÈëÒº¾§Ä£¿é
Èë¿Ú²ÎÊı£ºdictate
***************************************************/
void WriteInstruction (unsigned char dictate)
{
	while(BusyTest()==1);   //Èç¹ûÃ¦¾ÍµÈ´ı
	RS=0;                  //¸ù¾İ¹æ¶¨£¬RSºÍR/WÍ¬Ê±ÎªµÍµçÆ½Ê±£¬¿ÉÒÔĞ´ÈëÖ¸Áî
	RW=0;   
	E=0;                   //EÖÃµÍµçÆ½(¸ù¾İ±í8-6£¬Ğ´Ö¸ÁîÊ±£¬EÎª¸ßÂö³å£¬
                           // ¾ÍÊÇÈÃE´Ó0µ½1·¢ÉúÕıÌø±ä£¬ËùÒÔÓ¦ÏÈÖÃ"0"
  _nop_();
	_nop_();               //¿Õ²Ù×÷Á½¸ö»úÆ÷ÖÜÆÚ£¬¸øÓ²¼ş·´Ó¦Ê±¼ä
	P0=dictate;            //½«Êı¾İËÍÈëP0¿Ú£¬¼´Ğ´ÈëÖ¸Áî»òµØÖ·
	_nop_();
	_nop_();
	_nop_();
	_nop_();               //¿Õ²Ù×÷ËÄ¸ö»úÆ÷ÖÜÆÚ£¬¸øÓ²¼ş·´Ó¦Ê±¼ä
	E=1;                   //EÖÃ¸ßµçÆ½
	_nop_();
	_nop_();
	_nop_();
	_nop_();               //¿Õ²Ù×÷ËÄ¸ö»úÆ÷ÖÜÆÚ£¬¸øÓ²¼ş·´Ó¦Ê±¼ä
	E=0;                  //µ±EÓÉ¸ßµçÆ½Ìø±ä³ÉµÍµçÆ½Ê±£¬Òº¾§Ä£¿é¿ªÊ¼Ö´ĞĞÃüÁî
 }
/*****************************************************
º¯Êı¹¦ÄÜ£ºÖ¸¶¨×Ö·ûÏÔÊ¾µÄÊµ¼ÊµØÖ·
Èë¿Ú²ÎÊı£ºx
***************************************************/
void WriteAddress(unsigned char x)
{
	WriteInstruction(x|0x80); //ÏÔÊ¾Î»ÖÃµÄÈ·¶¨·½·¨¹æ¶¨Îª"80H+µØÖ·Âëx"
}
/*****************************************************
º¯Êı¹¦ÄÜ£º½«Êı¾İ(×Ö·ûµÄ±ê×¼ASCIIÂë)Ğ´ÈëÒº¾§Ä£¿é
Èë¿Ú²ÎÊı£ºy(Îª×Ö·û³£Á¿)
***************************************************/
void WriteData(unsigned char y)
{
	while(BusyTest()==1);  
	RS=1;           //RSÎª¸ßµçÆ½£¬RWÎªµÍµçÆ½Ê±£¬¿ÉÒÔĞ´ÈëÊı¾İ
	RW=0;
	E=0;            //EÖÃµÍµçÆ½(¸ù¾İ±í8-6£¬Ğ´Ö¸ÁîÊ±£¬EÎª¸ßÂö³å£¬
                     // ¾ÍÊÇÈÃE´Ó0µ½1·¢ÉúÕıÌø±ä£¬ËùÒÔÓ¦ÏÈÖÃ"0"
	P0=y;           //½«Êı¾İËÍÈëP0¿Ú£¬¼´½«Êı¾İĞ´ÈëÒº¾§Ä£¿é
	_nop_();
	_nop_();
 	_nop_();
  _nop_();       //¿Õ²Ù×÷ËÄ¸ö»úÆ÷ÖÜÆÚ£¬¸øÓ²¼ş·´Ó¦Ê±¼ä
	E=1;           //EÖÃ¸ßµçÆ½
	_nop_();
	_nop_();
	_nop_();
	_nop_();        //¿Õ²Ù×÷ËÄ¸ö»úÆ÷ÖÜÆÚ£¬¸øÓ²¼ş·´Ó¦Ê±¼ä
	E=0;            //µ±EÓÉ¸ßµçÆ½Ìø±ä³ÉµÍµçÆ½Ê±£¬Òº¾§Ä£¿é¿ªÊ¼Ö´ĞĞÃüÁî
}
/*****************************************************
º¯Êı¹¦ÄÜ£º¶ÔLCDµÄÏÔÊ¾Ä£Ê½½øĞĞ³õÊ¼»¯ÉèÖÃ
***************************************************/
void LcdInitiate(void)
{
    Delay_xMs(15);               //ÑÓÊ±15ms£¬Ê×´ÎĞ´Ö¸ÁîÊ±Ó¦¸øLCDÒ»¶Î½Ï³¤µÄ·´Ó¦Ê±¼ä
    WriteInstruction(0x38);     //ÏÔÊ¾Ä£Ê½ÉèÖÃ£º16¡Á2ÏÔÊ¾£¬5¡Á7µãÕó£¬8Î»Êı¾İ½Ó¿Ú
	  Delay_xMs(5);                //ÑÓÊ±5ms¡¡£¬¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
    WriteInstruction(0x38);
	  Delay_xMs(5);               //ÑÓÊ±5ms¡¡£¬¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
	  WriteInstruction(0x38);     //Á¬ĞøÈı´Î£¬È·±£³õÊ¼»¯³É¹¦
	  Delay_xMs(5);               //ÑÓÊ±5ms¡¡£¬¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
	  WriteInstruction(0x0c);     //ÏÔÊ¾Ä£Ê½ÉèÖÃ£ºÏÔÊ¾¿ª£¬ÎŞ¹â±ê£¬¹â±ê²»ÉÁË¸
	  Delay_xMs(5);               //ÑÓÊ±5ms¡¡£¬¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
	  WriteInstruction(0x06);     //ÏÔÊ¾Ä£Ê½ÉèÖÃ£º¹â±êÓÒÒÆ£¬×Ö·û²»ÒÆ
	  Delay_xMs(5);                //ÑÓÊ±5ms¡¡£¬¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
	  WriteInstruction(0x01);     //ÇåÆÁÄ»Ö¸Áî£¬½«ÒÔÇ°µÄÏÔÊ¾ÄÚÈİÇå³ı
	  Delay_xMs(5);             //ÑÓÊ±5ms¡¡£¬¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
 } 
/************************************************************************
ÒÔÏÂÊÇDS18B20µÄ²Ù×÷³ÌĞò
 ************************************************************************/ 
sbit DQ=P2^2;
unsigned char time;   //ÉèÖÃÈ«¾Ö±äÁ¿£¬×¨ÃÅÓÃÓÚÑÏ¸ñÑÓÊ±
/*****************************************************
º¯Êı¹¦ÄÜ£º½«DS18B20´«¸ĞÆ÷³õÊ¼»¯£¬¶ÁÈ¡Ó¦´ğĞÅºÅ
³ö¿Ú²ÎÊı£ºflag 
***************************************************/
bit Init_DS18B20(void)	
{
 bit flag;         //´¢´æDS18B20ÊÇ·ñ´æÔÚµÄ±êÖ¾£¬flag=0£¬±íÊ¾´æÔÚ£»flag=1£¬±íÊ¾²»´æÔÚ
 DQ = 1;           //ÏÈ½«Êı¾İÏßÀ­¸ß
 for(time=0;time<2;time++) //ÂÔÎ¢ÑÓÊ±Ô¼6Î¢Ãë
     ;
 DQ = 0;           //ÔÙ½«Êı¾İÏß´Ó¸ßÀ­µÍ£¬ÒªÇó±£³Ö480~960us
 for(time=0;time<200;time++)  //ÂÔÎ¢ÑÓÊ±Ô¼600Î¢Ãë
     ;         //ÒÔÏòDS18B20·¢³öÒ»³ÖĞø480~960usµÄµÍµçÆ½¸´Î»Âö³å 
 DQ = 1;           //ÊÍ·ÅÊı¾İÏß£¨½«Êı¾İÏßÀ­¸ß£© 
 for(time=0;time<10;time++)
     ;  //ÑÓÊ±Ô¼30us£¨ÊÍ·Å×ÜÏßºóĞèµÈ´ı15~60usÈÃDS18B20Êä³ö´æÔÚÂö³å£©
 flag=DQ;          //ÈÃµ¥Æ¬»ú¼ì²âÊÇ·ñÊä³öÁË´æÔÚÂö³å£¨DQ=0±íÊ¾´æÔÚ£©      
 for(time=0;time<200;time++)  //ÑÓÊ±×ã¹»³¤Ê±¼ä£¬µÈ´ı´æÔÚÂö³åÊä³öÍê±Ï
      ;
 return (flag);    //·µ»Ø¼ì²â³É¹¦±êÖ¾
}
/*****************************************************
º¯Êı¹¦ÄÜ£º´ÓDS18B20¶ÁÈ¡Ò»¸ö×Ö½ÚÊı¾İ
³ö¿Ú²ÎÊı£ºdat
***************************************************/ 
unsigned char ReadOneChar(void)
{
	unsigned char i=0;	
	unsigned char dat;  //´¢´æ¶Á³öµÄÒ»¸ö×Ö½ÚÊı¾İ
	for (i=0;i<8;i++)
	{
		DQ =1;       // ÏÈ½«Êı¾İÏßÀ­¸ß
		_nop_();	    //µÈ´ıÒ»¸ö»úÆ÷ÖÜÆÚ	 
		DQ = 0;      //µ¥Æ¬»ú´ÓDS18B20¶ÁÊé¾İÊ±,½«Êı¾İÏß´Ó¸ßÀ­µÍ¼´Æô¶¯¶ÁÊ±Ğò
		dat>>=1;
		_nop_();     //µÈ´ıÒ»¸ö»úÆ÷ÖÜÆÚ		   
		DQ = 1;     //½«Êı¾İÏß"ÈËÎª"À­¸ß,Îªµ¥Æ¬»ú¼ì²âDS18B20µÄÊä³öµçÆ½×÷×¼±¸
		for(time=0;time<2;time++)
             ;      //ÑÓÊ±Ô¼6us£¬Ê¹Ö÷»úÔÚ15usÄÚ²ÉÑù
		if(DQ==1)
			dat|=0x80;  //Èç¹û¶Áµ½µÄÊı¾İÊÇ1£¬Ôò½«1´æÈëdat
		else
		  dat|=0x00;//Èç¹û¶Áµ½µÄÊı¾İÊÇ0£¬Ôò½«0´æÈëdat
		     //½«µ¥Æ¬»ú¼ì²âµ½µÄµçÆ½ĞÅºÅDQ´æÈër[i]	
		for(time=0;time<8;time++)
		      	;              //ÑÓÊ±3us,Á½¸ö¶ÁÊ±ĞòÖ®¼ä±ØĞëÓĞ´óÓÚ1usµÄ»Ö¸´ÆÚ	
	 }	                    
	 return (dat);    //·µ»Ø¶Á³öµÄÊ®½øÖÆÊı¾İ
}
/*****************************************************
º¯Êı¹¦ÄÜ£ºÏòDS18B20Ğ´ÈëÒ»¸ö×Ö½ÚÊı¾İ
Èë¿Ú²ÎÊı£ºdat
***************************************************/  
WriteOneChar(unsigned char dat)
{
	unsigned char i=0;
	for (i=0; i<8; i++)
	{
		DQ =1;         // ÏÈ½«Êı¾İÏßÀ­¸ß
		_nop_();	     //µÈ´ıÒ»¸ö»úÆ÷ÖÜÆÚ	 
		DQ=0;          //½«Êı¾İÏß´Ó¸ßÀ­µÍÊ±¼´Æô¶¯Ğ´Ê±Ğò       
		DQ=dat&0x01;   //ÀûÓÃÓëÔËËãÈ¡³öÒªĞ´µÄÄ³Î»¶ş½øÖÆÊı¾İ,
                       //²¢½«ÆäËÍµ½Êı¾İÏßÉÏµÈ´ıDS18B20²ÉÑù	
		for(time=0;time<10;time++)	
		     ;//ÑÓÊ±Ô¼30us£¬DS18B20ÔÚÀ­µÍºóµÄÔ¼15~60usÆÚ¼ä´ÓÊı¾İÏßÉÏ²ÉÑù
		DQ=1;          //ÊÍ·ÅÊı¾İÏß		    
		for(time=0;time<1;time++)
			  ;//ÑÓÊ±3us,Á½¸öĞ´Ê±Ğò¼äÖÁÉÙĞèÒª1usµÄ»Ö¸´ÆÚ
		dat>>=1;       //½«datÖĞµÄ¸÷¶ş½øÖÆÎ»Êı¾İÓÒÒÆ1Î»
	}
	for(time=0;time<4;time++)
	              ; //ÉÔ×÷ÑÓÊ±,¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
}
/******************************************************************************
ÒÔÏÂÊÇÓëÎÂ¶ÈÓĞ¹ØµÄÏÔÊ¾ÉèÖÃ
 ******************************************************************************/
 /*****************************************************
º¯Êı¹¦ÄÜ£ºÏÔÊ¾Ã»ÓĞ¼ì²âµ½DS18B20
***************************************************/   
void display_error(void)
{
	unsigned char i;
	WriteAddress(0x00);    //Ğ´ÏÔÊ¾µØÖ·£¬½«ÔÚµÚ1ĞĞµÚ1ÁĞ¿ªÊ¼ÏÔÊ¾
  i = 0;                //´ÓµÚÒ»¸ö×Ö·û¿ªÊ¼ÏÔÊ¾
  while(Error[i] != '\0')  //Ö»ÒªÃ»ÓĞĞ´µ½½áÊø±êÖ¾£¬¾Í¼ÌĞøĞ´
		{
			WriteData(Error[i]);   //½«×Ö·û³£Á¿Ğ´ÈëLCD
			i++;                 //Ö¸ÏòÏÂÒ»¸ö×Ö·û
			Delay_xMs(100);//ÑÓÊ±100ms½Ï³¤Ê±¼ä£¬ÒÔ¿´Çå¹ØÓÚÏÔÊ¾µÄËµÃ÷
		}	
	while(1)              //½øÈëËÀÑ­»·£¬µÈ´ı²éÃ÷Ô­Òò
				  ;
}
/*****************************************************
º¯Êı¹¦ÄÜ£ºÏÔÊ¾ÎÂ¶È·ûºÅ
***************************************************/   
void display_symbol(void)
{
	unsigned char i;
	WriteAddress(0x00);    //Ğ´ÏÔÊ¾µØÖ·£¬½«ÔÚµÚ2ĞĞµÚ1ÁĞ¿ªÊ¼ÏÔÊ¾
	i = 0;                //´ÓµÚÒ»¸ö×Ö·û¿ªÊ¼ÏÔÊ¾
	while(Temp[i] != '\0')  //Ö»ÒªÃ»ÓĞĞ´µ½½áÊø±êÖ¾£¬¾Í¼ÌĞøĞ´
		{
			WriteData(Temp[i]);   //½«×Ö·û³£Á¿Ğ´ÈëLCD
			i++;                 //Ö¸ÏòÏÂÒ»¸ö×Ö·û
			Delay_xMs(50);        //ÑÓÊ±1ms¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
		}	
}

/*****************************************************
º¯Êı¹¦ÄÜ£ºÏÔÊ¾ÎÂ¶ÈµÄĞ¡Êıµã
***************************************************/   
void 	display_dot(void)
{
	WriteAddress(0x09);	  //Ğ´ÏÔÊ¾µØÖ·£¬½«ÔÚµÚ2ĞĞµÚ10ÁĞ¿ªÊ¼ÏÔÊ¾		   
	WriteData('.');      //½«Ğ¡ÊıµãµÄ×Ö·û³£Á¿Ğ´ÈëLCD
	Delay_xMs(50);         //ÑÓÊ±1ms¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä		
}
/*****************************************************
º¯Êı¹¦ÄÜ£ºÏÔÊ¾ÎÂ¶ÈµÄµ¥Î»(Cent)
***************************************************/   
void 	display_cent(void)
{
  unsigned char i;    
	WriteAddress(0x0c);        //Ğ´ÏÔÊ¾µØÖ·£¬½«ÔÚµÚ2ĞĞµÚ13ÁĞ¿ªÊ¼ÏÔÊ¾	
	i = 0;                    //´ÓµÚÒ»¸ö×Ö·û¿ªÊ¼ÏÔÊ¾ 
	while(Cent[i] != '\0')     //Ö»ÒªÃ»ÓĞĞ´µ½½áÊø±êÖ¾£¬¾Í¼ÌĞøĞ´
		{
			WriteData(Cent[i]);     //½«×Ö·û³£Á¿Ğ´ÈëLCD
	    i++;                 //Ö¸ÏòÏÂÒ»¸ö×Ö·û
	    Delay_xMs(50);        //ÑÓÊ±1ms¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
	  }	
}
/*****************************************************
º¯Êı¹¦ÄÜ£ºÏÔÊ¾ÎÂ¶ÈµÄÕûÊı²¿·Ö
Èë¿Ú²ÎÊı£ºx
***************************************************/ 
void display_temp1(unsigned char x)
{
	unsigned char j,k,l;     //j,k,l·Ö±ğ´¢´æÎÂ¶ÈµÄ°ÙÎ»¡¢Ê®Î»ºÍ¸öÎ»
  j=x/100;              //È¡°ÙÎ»
	k=(x%100)/10;    //È¡Ê®Î»
	l=x%10;             //È¡¸öÎ»  
	WriteAddress(0x06);    //Ğ´ÏÔÊ¾µØÖ·,½«ÔÚµÚ2ĞĞµÚ7ÁĞ¿ªÊ¼ÏÔÊ¾
	WriteData(digit[j]);    //½«°ÙÎ»Êı×ÖµÄ×Ö·û³£Á¿Ğ´ÈëLCD
	WriteData(digit[k]);    //½«Ê®Î»Êı×ÖµÄ×Ö·û³£Á¿Ğ´ÈëLCD
	WriteData(digit[l]);    //½«¸öÎ»Êı×ÖµÄ×Ö·û³£Á¿Ğ´ÈëLCD
	Delay_xMs(50);         //ÑÓÊ±1ms¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä     
 }
 /*****************************************************
º¯Êı¹¦ÄÜ£ºÏÔÊ¾ÎÂ¶ÈµÄĞ¡ÊıÊı²¿·Ö
Èë¿Ú²ÎÊı£ºx
***************************************************/ 
 void display_temp2(unsigned char x)
{
 	WriteAddress(0x0a);      //Ğ´ÏÔÊ¾µØÖ·,½«ÔÚµÚ2ĞĞµÚ11ÁĞ¿ªÊ¼ÏÔÊ¾
	WriteData(digit[x]);     //½«Ğ¡Êı²¿·ÖµÄµÚÒ»Î»Êı×Ö×Ö·û³£Á¿Ğ´ÈëLCD
	Delay_xMs(50);          //ÑÓÊ±1ms¸øÓ²¼şÒ»µã·´Ó¦Ê±¼ä
}
/*****************************************************
º¯Êı¹¦ÄÜ£º×öºÃ¶ÁÎÂ¶ÈµÄ×¼±¸
***************************************************/ 
void ReadyReadTemp(void)
{
	Init_DS18B20();     //½«DS18B20³õÊ¼»¯
	WriteOneChar(0xCC); // Ìø¹ı¶ÁĞòºÅÁĞºÅµÄ²Ù×÷
	WriteOneChar(0x44); // Æô¶¯ÎÂ¶È×ª»»	  
	for(time=0;time<100;time++);	 //ÎÂ¶È×ª»»ĞèÒªÒ»µãÊ±¼ä
	Init_DS18B20();     //½«DS18B20³õÊ¼»¯
	WriteOneChar(0xCC); //Ìø¹ı¶ÁĞòºÅÁĞºÅµÄ²Ù×÷
	WriteOneChar(0xBE); //¶ÁÈ¡ÎÂ¶È¼Ä´æÆ÷,Ç°Á½¸ö·Ö±ğÊÇÎÂ¶ÈµÄµÍÎ»ºÍ¸ßÎ»	
}

/******************************************************************************/
/* º¯ÊıÃû³Æ  : main                                                           */
/* º¯ÊıÃèÊö  : Ö÷º¯Êı                                                         */
/* ÊäÈë²ÎÊı  : ÎŞ                                                             */
/* ²ÎÊıÃèÊö  : ÎŞ                                                             */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/					
void main(void)
{
	unsigned char TL;     //´¢´æÔİ´æÆ÷µÄÎÂ¶ÈµÍÎ»
  unsigned char TH;    //´¢´æÔİ´æÆ÷µÄÎÂ¶È¸ßÎ»
  unsigned char TN;      //´¢´æÎÂ¶ÈµÄÕûÊı²¿·Ö
	unsigned char TD;       //´¢´æÎÂ¶ÈµÄĞ¡Êı²¿·Ö
	int fflag;
	VELOCITY=3453;       //23ÉãÊÏ¶ÈÊ±µÄÉùËÙ£¬ÉùËÙV= 331.5 + 0.6*ÎÂ¶È£»
  RW = 0;
	initLCD();
	Init_MCU();
	Init_Parameter();
	Alarm(2);
	display_char(table,0x00);
	display_char(table0,0x40);
	Delay_xMs(30000);
	display_char(table2,0x00);
	display_char(table1,0x40);
	if(Init_DS18B20()==1)
		display_error();
  display_symbol();    //ÏÔÊ¾ÎÂ¶ÈËµÃ÷
  display_dot();       //ÏÔÊ¾ÎÂ¶ÈµÄĞ¡Êıµã
  display_cent();      //ÏÔÊ¾ÎÂ¶ÈµÄµ¥Î»
	while(1)
	{
		 Trig_SuperSonic(8);         //´¥·¢³¬Éù²¨·¢Éä
//		 while(INPUT == 0)          //µÈ´ı»ØÉù
//         {
//             ;
//         }
		 ReadyReadTemp();     //¶ÁÎÂ¶È×¼±¸
	   TL=ReadOneChar();    //ÏÈ¶ÁµÄÊÇÎÂ¶ÈÖµµÍÎ»
		 TH=ReadOneChar();    //½Ó×Å¶ÁµÄÊÇÎÂ¶ÈÖµ¸ßÎ»
		 TN=TH*16+TL/16;      //Êµ¼ÊÎÂ¶ÈÖµ=(TH*256+TL)/16,¼´£ºTH*16+TL/16
			                  //ÕâÑùµÃ³öµÄÊÇÎÂ¶ÈµÄÕûÊı²¿·Ö,Ğ¡Êı²¿·Ö±»¶ªÆúÁË
		 VELOCITY=3315+6*TN;// 331.5 + 0.6*ÎÂ¶È£»
		 fflag=Measure_Distance();        //¼ÆËãÂö¿í²¢×ª»»Îª¾àÀë
//		 ReadyReadTemp();     //¶ÁÎÂ¶È×¼±¸
//	   TL=ReadOneChar();    //ÏÈ¶ÁµÄÊÇÎÂ¶ÈÖµµÍÎ»
//		 TH=ReadOneChar();    //½Ó×Å¶ÁµÄÊÇÎÂ¶ÈÖµ¸ßÎ»
//		 TN=TH*16+TL/16;      //Êµ¼ÊÎÂ¶ÈÖµ=(TH*256+TL)/16,¼´£ºTH*16+TL/16
			                  //ÕâÑùµÃ³öµÄÊÇÎÂ¶ÈµÄÕûÊı²¿·Ö,Ğ¡Êı²¿·Ö±»¶ªÆúÁË
	   TD=(TL%16)*10/16;    //¼ÆËãÎÂ¶ÈµÄĞ¡Êı²¿·Ö,½«ÓàÊı³ËÒÔ10ÔÙ³ıÒÔ16È¡Õû£¬
			                  //ÕâÑùµÃµ½µÄÊÇÎÂ¶ÈĞ¡Êı²¿·ÖµÄµÚÒ»Î»Êı×Ö(±£Áô1Î»Ğ¡Êı)
	   display_temp1(TN);    //ÏÔÊ¾ÎÂ¶ÈµÄÕûÊı²¿·Ö
	   display_temp2(TD);    //ÏÔÊ¾ÎÂ¶ÈµÄĞ¡Êı²¿·Ö
		 display_char(table3,0x40);
		 if(fflag){
		 display(distance,0x49);    //ÏÔÊ¾¾àÀë
		 }
		 Init_Parameter();          // ²ÎÊıÖØĞÂ³õÊ¼»¯
		 delayt(100);               //ÑÓÊ±£¬Á½´Î·¢ÉäÖ®¼äÒªÖÁÉÙÓĞ10ms¼ä¸ô
	 }	
}
/******************************************************************************/
/* º¯ÊıÃû³Æ  : timer0                                                         */
/* º¯ÊıÃèÊö  : T0ÖĞ¶Ï´¦Àíº¯Êı                                                 */
/* ÊäÈë²ÎÊı  : ÎŞ                                                             */
/* ²ÎÊıÃèÊö  : ÎŞ                                                             */
/* ·µ»ØÖµ    : ÎŞ                                                             */
/******************************************************************************/
void timer0 (void) interrupt 1
{
	TF0 = 0;
	TL0 = 0x66;
	TH0 = 0xfc;
	count++;
	if(count == 18)//³¬Éù²¨»ØÉùÂö¿í×î¶à18ms
	{
		TR0 =0;
		TL0 = 0x66;
		TH0 = 0xfc;
		count = 0;
	}
}
/******************************************************************************/